/**
 * Created by ferney on 01.11.17.
 */
public class PersonRankUpdater {

    public static void updatePersonRanks(){
        //проходим по массиву ссылок
        //к каждой странице применяем downloader
        //ищем и считаем ключевые слова
        //записываем результат в базу
    }

    //TODO нужны от базы следующие обертки: список ключевых слов с ID персоны (массив объектов?), список страниц сайтов
    //(массив объектов? с ID  страницы?)
    //обертка для записи ранга персоны в таблицу
}
